export default {
  ru: {
    translation: {
      buttons: {
        logIn: 'Войти',
        logOut: 'Выйти',
        cancel: 'Отмена',
        add: 'Отправить',
        rename: 'Переименовать',
        register: 'Зарегистрироваться',
        delete: 'Удалить',
      },
      addModal: {
        placeholder: 'Введите название канала...',
        title: 'Добавить новый канал',
      },
      removeModal: {
        title: 'Удалить канал',
        confirm: 'Уверены?',
      },
      renameModal: {
        title: 'Переименовать канал',
      },
      regPage: {
        title: 'Регистрация',
        login: 'Имя пользователя',
      },
      valid: {
        maxmin: 'От 3 до 20 символов',
        maxminCh: 'От 4 до 20 символов',
        min: 'Не менее 6 символов',
        required: 'Обязтельное поле',
        requiredConfirm: 'Подтвердите пароль',
        match: 'Пароли должны совпадать',
        unique: 'Должно быть уникальным',
        exist: 'Пользователь с таким логином уже существует',
        incorrect: 'Неверные имя пользователя или пароль',
      },
      toast: {
        create: 'Канал успешно создан!',
        delete: 'Канал успешно удален!',
        rename: 'Канал успешно переименован!',
        error: 'Ошибка соединения',
        authErr: 'Ошибка авторизации. Сервер отклонил запрос, пожалуйста войдите заново.',
      },
      networkErr: 'Ошибка соединения',
      pass: 'Пароль',
      login: 'Ваш ник',
      welcome: 'Добро пожаловать в уютный чат',
      messagePlace: 'Введите сообщение...',
      noAccount: 'Нет аккаунта? ',
      404: 'Упс... Такой страницы не существует',
      goBack: 'Перейти на главную',
      message_one: '{{count}} сообщение',
      message_few: '{{count}} сообщения',
      message_many: '{{count}} сообщений',
    },
  },
};
